xvicam/mvp/cyclist/esp32/src/main.cpp
            if (!sys::isCrashed) {
                sys::enterCrashMode(mockEv, o);
                Serial.println("Simulated crash triggered. Switched to BLE Mode.");
            } else {
                Serial.println("Already in crash mode.");
            }
        }
    }

    static uint32_t lastPulseMs = 0;
    uint32_t pulseInterval = sys::isBonding ? 250 : 2000;
    if (now - lastPulseMs > pulseInterval) {
        lastPulseMs = now;
        espNow::led::pulse(50);
    }

    static uint32_t btnPressTime = 0;
    static bool actionTriggered = false;
    if (digitalRead(BUTTON_PIN) == HIGH) {
        if (btnPressTime == 0) {
            btnPressTime = now;
            actionTriggered = false;
        } else if (now - btnPressTime > 3000 && !actionTriggered) {
            actionTriggered = true;
            if (sys::isCrashed) {
                Serial.println("Button held in crash mode, ignoring bonding request...");
            } else if (!sys::isBonding) {
                Serial.println("Button held for 3 seconds, entering bonding mode...");
                sys::enterBonding();
            } else {
                Serial.println("Button held for 3 seconds, exiting bonding mode...");
                sys::enterOperating();
            }
        }
    } else {
        btnPressTime = 0;
        actionTriggered = false;
    }

    if (sys::bondingCompleteFlag) {
        sys::bondingCompleteFlag = false;
        sys::enterOperating();
    }

    if (sys::isBonding && (now - sys::bondingStartTime > 120000)) {
        Serial.println("Bonding timeout, entering operating mode...");
        sys::enterOperating();
    }

    if (imuPrint::initialised && (now - imuPrint::lastPrintMs >= imuPrint::kPrintPeriodMs)) {
        imuPrint::lastPrintMs = now;
        ImuSample s;

        if (imuPrint::imu.readSample(s)) {
            espNow::lastImuSample = s;
            const ImuOrientation o = imuPrint::imu.computeOrientation(s);
            static crash::CrashDetector detector;
            const crash::CrashEvent ev = detector.update(now, s, o);

            if (ev.triggered && !sys::isCrashed) {
                sys::enterCrashMode(ev, o);
            }

            const gnss::Fix fix = gnss::lastFix();
            if (gnss::hasFix(30000)) {
                Serial.printf("GPS - Lat: %.7f, Lng: %.7f, Alt: %.2f | ", fix.latDeg, fix.lngDeg, fix.altMeters);
            } else {
                Serial.print("GPS - Waiting for fix... | ");
            }

            int rawValue = analogRead(batteryPin);
            float voltage = (rawValue / 4095.0) * 3.3 * 2.0;
            float percentage = (voltage - 3.3) / (4.2 - 3.3) * 100;

            if (percentage > 100) percentage = 100;
            if (percentage < 0) percentage = 0;

            Serial.printf("Voltage: %.2fV | Percentage: %.1f%% ", voltage, percentage);

            imuPrint::printImuLine(s, o);

            powerMgr::update(now, o.isMoving);
        }
    }

    if (sys::isCrashed) {
        if (sys::crashNotificationAcknowledged || (millis() - sys::crashModeStartTime > 120000)) {
            Serial.println("Crash mode ended (ACK received or timeout). Returning to operating mode...");
            sys::enterOperating();
        } else {
            static uint32_t lastCrashSend = 0;
            if (now - lastCrashSend > 1000) {
                lastCrashSend = now;
                ble::sendCrash(sys::lastCrash.crashId, sys::lastCrash.peakDynamicMps2, sys::lastCrashOrientation);
            }
        }
    }

    if (sys::isBonding) ble::tick(now);
}
